//Sentinel
//Detect usage of of encoded powershell commands
DeviceEvents
| where TimeGenerated > ago(1d)
| where InitiatingProcessFileName has "powershell"
| where InitiatingProcessCommandLine contains "-e" or InitiatingProcessCommandLine contains "-encodedcommand" or InitiatingProcessCommandLine contains "-enc"
| project
    TimeGenerated,
    InitiatingProcessAccountName,
    DeviceName,
    InitiatingProcessCommandLine,
    InitiatingProcessFolderPath,
    AdditionalFields
| sort by TimeGenerated desc 
