// Detect Endpoint connectiong to domains way too often
DeviceNetworkEvents
| extend ReverseURL=reverse(RemoteUrl)
//split URL on every Dot
| extend substring=split(ReverseURL, '.')
// Combine the Domain
| extend revDomain=strcat(substring[0], ".", substring[1]) 
// reverse Domain back to normal
| extend Domain=reverse(revDomain)
| where isnotempty(RemoteUrl)
//sum Domain queries
| summarize Amount=count() by Domain, RemoteIP
| sort by Amount desc 
